In [3]:
import pandas as pd
import numpy as np

In [32]:
dict1={'Names':['Arvind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}

dict1

{'Names': ['Arvind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [33]:
d1=pd.DataFrame(dict1)

In [34]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [35]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

In [36]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [37]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [38]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number this applicable for numerical column only
- generally, data has empty rows
- it is data problem
- if you read that kind of data you will see Null
- you need to understand it is a data corrupted or really a Null values are there

**Method-1**

**Fill with some random value**

**Method name: fill na**

In [39]:
d1.fillna(40)

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2      40  32.0  Chennai
3    Siri  43.0       40

**Method-2**

- we can fill values w.r.t columns also

In [40]:
d1['Age'].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [41]:
d1

## it will in show as 40, but not updated
## put inplace=True then it will update

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [42]:
d1['Age'].fillna(40,inplace=True)
d1

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [43]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

**Method-3**

- bfill
- ffill
- pad
- backfill

In [47]:
d1.fillna(method='bfill')

# Column1: Names index 4 is missing values it is filled with index 3 value
# Column2: Age index 1 missing value it is filled with previous value 40
# Column3: City index 4 is missing value it should be fill with next value but we dont have it

C:\Users\rachn\AppData\Local\Temp\ipykernel_22712\999256251.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2    Siri  32.0  Chennai
3    Siri  43.0      NaN

In [48]:
d1.fillna(method='ffill')

C:\Users\rachn\AppData\Local\Temp\ipykernel_22712\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    Siri  43.0  Chennai

In [49]:
d1.fillna(method='ffill',axis=1)

C:\Users\rachn\AppData\Local\Temp\ipykernel_22712\13672963.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=1)

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0     43.0

In [50]:
d1.fillna(method='pad')

C:\Users\rachn\AppData\Local\Temp\ipykernel_22712\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    Siri  43.0  Chennai

In [51]:
d1.fillna(method='backfill')

C:\Users\rachn\AppData\Local\Temp\ipykernel_22712\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2    Siri  32.0  Chennai
3    Siri  43.0      NaN

- backfill & bfill fill with next value
- pad & ffill fill with previous value
- but it will change based on axis

**Method-4**

- mean
    - numerical values can fill with mean values
    - but mean affect by outliers
    - if we don't have outliers it is best one
- median
    - numerical values can fill with median value
    - we know that median value does not affect with outliers
    - so if outliers are there we can go with median
- mode
    - mode is useful for categorical data

In [53]:
## we already know we can fill with some values based on specifically
# column using 
# d1.fillna(<random_number>)
# d1 represents all columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [55]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [58]:
age_mode=d1['City'].mode()
d1['City'].fillna(age_mode)

0        Hyd
1        Blr
2    Chennai
3        NaN
Name: City, dtype: object

In [61]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)

age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

- Fill with random value
- Fill with random value on specified value
- Fill with methods
    - bfill
    - ffill
    - pad
    - backfill
- Fill with
    - Mean
    - Median
    - Mode

**Method-5**

**KNN imputer**

- KNN: K nearest neighbours
- K is a hyper parameter means user can choose
- it is distance metric: **Euclidean distance**
- KNN imputer will take mean of neighbour's value
- the neighbours value can be provided by using value = k
- it is under sklearn package
- under sklearn we have imputer method
- under imputer method we have KNNImputer
- applicable only for numerical data

In [63]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[40.],
       [21.],
       [32.],
       [43.]])